src/Reports/ОтчётПоДолгамЗНП/ОтчётПоДолгамЗНП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоДолгамЗНП</name>
</mdclass:Report>

src/AccumulationRegisters/РезервированиеГП/РезервированиеГП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервированиеГП</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ПланыВыпуска/ПланыВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланыВыпуска</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутнаяКарта</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Долги/Долги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Долги</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Reports/ОтчётПоДолгамЗНП/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьКоличествоГотовоКОтгрузке(Продукция)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РезервированиеГПОстатки.Продукция КАК Продукция,
	|	РезервированиеГПОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.РезервированиеГП.Остатки(
	|			&НаДату,
	|			МестоХранения = &МестоХранения
	|				И Продукция = &Продукция) КАК РезервированиеГПОстатки
	|ИТОГИ
	|	СУММА(КоличествоОстаток)
	|ПО
	|	Продукция";
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
Запрос.УстановитьПараметр("Продукция", Продукция);
	Если ТипЗнч(Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
	Запрос.УстановитьПараметр("МестоХранения", Продукция.Линейка.МестоХраненияГП);		
	Иначе	
	Запрос.УстановитьПараметр("МестоХранения", Константы.МестоХраненияТНП.Получить());		
	КонецЕсли;
РезультатЗапроса = Запрос.Выполнить();
ВыборкаПродукция = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПродукция.Следующий() Цикл
	Возврат(ВыборкаПродукция.КоличествоОстаток);
	КонецЦикла;
Возврат(0);
КонецФункции 

&НаСервере
Функция ПолучитьКоличествоВПроизводстве(Продукция)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыВыпускаОстатки.Номенклатура КАК Номенклатура,
	|	ПланыВыпускаОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ПланыВыпуска.Остатки(&НаДату, Номенклатура = &Номенклатура) КАК ПланыВыпускаОстатки
	|ИТОГИ
	|	СУММА(КоличествоОстаток)
	|ПО
	|	Номенклатура";
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
Запрос.УстановитьПараметр("Номенклатура", Продукция);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
	Возврат(ВыборкаНоменклатура.КоличествоОстаток);
	КонецЦикла;                                    
Возврат(0);
КонецФункции 

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.НаДату = ТекущаяДата();
ТабДок.Вывести(ОблШапка);

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДолгиОстатки.Продукция КАК Продукция,
	|	ДолгиОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ДолгиОстатки.Продукция.Товар КАК Товар
	|ИЗ
	|	РегистрНакопления.Долги.Остатки(&НаДату, ) КАК ДолгиОстатки";
	Если СписокТоваров.Количество() > 0 Тогда	
	Запрос.Текст = Запрос.Текст + " ГДЕ ДолгиОстатки.Продукция.Товар В ИЕРАРХИИ(&СписокТоваров)";
	Запрос.УстановитьПараметр("СписокТоваров",СписокТоваров);
	КонецЕсли; 
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО
								|	ДолгиОстатки.Продукция.Товар.Наименование
								|ИТОГИ
								|	СУММА(КоличествоОстаток)
								|ПО
								|	Продукция";
Запрос.УстановитьПараметр("НаДату",ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаПродукция = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПродукция.Следующий() Цикл
	ОблСтрока.Параметры.НаименованиеПродукция = СокрЛП(ВыборкаПродукция.Продукция.Наименование);
	ОблСтрока.Параметры.Продукция = ВыборкаПродукция.Продукция;
	ОблСтрока.Параметры.НаименованиеТовар = СокрЛП(ВыборкаПродукция.Товар.Наименование);
	ОблСтрока.Параметры.Товар = ВыборкаПродукция.Товар;
	ОблСтрока.Параметры.КоличествоДолг = ВыборкаПродукция.КоличествоОстаток;
	ОблСтрока.Параметры.КоличествоВПроизводстве = ПолучитьКоличествоВПроизводстве(ВыборкаПродукция.Продукция);
	ОблСтрока.Параметры.КоличествоГотовоКОтгрузке = ПолучитьКоличествоГотовоКОтгрузке(ВыборкаПродукция.Продукция);
	ОблСтрока.Параметры.КоличествоНеСоздано = ВыборкаПродукция.КоличествоОстаток - ОблСтрока.Параметры.КоличествоВПроизводстве - ОблСтрока.Параметры.КоличествоГотовоКОтгрузке;
		Если ТипЗнч(ВыборкаПродукция.Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
		ОблСтрока.Параметры.КоличествоНаСкладе = ОбщийМодульВызовСервера.ПолучитьОстатокПоМестуХранения(ВыборкаПродукция.Продукция.Линейка.МестоХраненияГП,ВыборкаПродукция.Продукция);		
		Иначе
		ОблСтрока.Параметры.КоличествоНаСкладе = ОбщийМодульВызовСервера.ПолучитьОстатокПоМестуХранения(Константы.МестоХраненияТНП.Получить(),ВыборкаПродукция.Продукция);			
		КонецЕсли;
	ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
